[
    {
        "vac_id": 1,
        "add_date": "2022-06-15",
        "company": "Мы - международная группа компаний BelkaPost.Ru с операционными офисами в Москве, Волгограде и штаб-квартирой в Израиле, и 10-летней историей работы. Наш основной продукт - ERP решение для B2B, позволяющее автоматизировать выбор и процесс отправки документов и груза, а также отслеживание перевозки, анализ и отчётность.\r\nИщем опытного Фулстек разработчика для поддержания работоспособности и разработки новых фишек в нашем решении построенном на микросервисах\r\nЕсли вы хотите кодить принципиально новый b2b продукт для логистического рынка с использованием инновационных решений, то вам сюда",
        "company_description": "Мы - международная группа компаний BelkaPost.Ru с операционными офисами в Москве, Волгограде и штаб-квартирой в Израиле, и 10-летней историей работы. Наш основной продукт - ERP решение для B2B, позволяющее автоматизировать выбор и процесс отправки документов и груза, а также отслеживание перевозки, анализ и отчётность.\r\nИщем опытного Фулстек разработчика для поддержания работоспособности и разработки новых фишек в нашем решении построенном на микросервисах\r\nЕсли вы хотите кодить принципиально новый b2b продукт для логистического рынка с использованием инновационных решений, то вам сюда",
        "role": "React Native Developer",
        "role_type": "Mobile Developer",
        "role_description": "Описание вакансии",
        "skill": "Junior",
        "min_salary": 150000,
        "max_salary": 200000,
        "salary_type": "RUB",
        "remote": true,
        "relocation": false,
        "employment": "Частичная занятость",
        "location_country": "Россия",
        "location_city": "Москва",
        "tasks": [
            "разработка архитектуры и реализация мобильного приложения на базе Expo / React Native для маркетплейса",
            "интеграция с бекендом, платежными системами, картами, пушами и так далее",
            "планирование и внедрение нового функционала",
            "взаимодействие с бекенд командой в утверждении спецификаций API",
            "помощь и ревью кода для младших разработчиков (1-2 человека)",
            "взаимодействие с DevOps в настройке автоматизированных релизов (Expo EAS)",
            "написание или участие в написании биндингов к нативным модулям",
        ],
        "requirements": [
            "опыт коммерческой разработки на React Native от 2 лет",
            "уверенное владение Typescript",
            "глубокое понимание принципов работы React или React Native",
            "опыт построения архитектуры мобильных приложений на RN",
            "существенным опытом будет опыт написания биндингов к нативным модулям и базовое понимание Swift / Objective C",
            "уверенное владение гитом (Gitlab)",
            "английский на уровне чтения технической документации (B1+)",
        ],
        "technologies": [
            "NodeJs",
            "HTML",
            "JavaScript(ES6+)"
        ],
        "offers": [
            "опыт коммерческой разработки на React Native от 2 лет",
            "уверенное владение Typescript",
            "глубокое понимание принципов работы React или React Native",
            "опыт построения архитектуры мобильных приложений на RN",
            "существенным опытом будет опыт написания биндингов к нативным модулям и базовое понимание Swift / Objective C",
            "уверенное владение гитом (Gitlab)",
            "английский на уровне чтения технической документации (B1+)",
        ],
        "willbeplus": [
            "опыт коммерческой разработки на React Native от 2 лет",
            "уверенное владение Typescript",
            "глубокое понимание принципов работы React или React Native",
            "опыт построения архитектуры мобильных приложений на RN",
            "существенным опытом будет опыт написания биндингов к нативным модулям и базовое понимание Swift / Objective C",
            "уверенное владение гитом (Gitlab)",
            "английский на уровне чтения технической документации (B1+)",
        ]
    },
];

export default vac;